experiments/geo-mysql/results/mysql-writes-500-k6.txt
time="2026-09-26T09:44:50+09:00" level=warning msg="Insufficient VUs, reached 400 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=probe
time="2026-09-26T09:44:59+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.59243469337255&lng=127.03670933238456\": request timeout"
time="2026-09-26T09:44:59+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.50830074993393&lng=127.0382595877859\": request timeout"
time="2026-09-26T09:45:00+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.594518668873576&lng=127.02113966083866\": request timeout"
time="2026-09-26T09:45:00+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.527674506893774&lng=127.0654710889297\": request timeout"
time="2026-09-26T09:45:00+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.5316264668747&lng=126.94452776238552\": request timeout"
time="2026-09-26T09:45:02+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.5187019171317&lng=126.93156035137801\": request timeout"
time="2026-09-26T09:45:03+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.61744669937351&lng=126.96069041061781\": request timeout"
time="2026-09-26T09:45:03+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57923766873477&lng=127.07301021967365\": request timeout"
time="2026-09-26T09:45:03+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.51376389965695&lng=126.99826650681044\": request timeout"
time="2026-09-26T09:45:04+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.50518266870654&lng=127.04523293170487\": request timeout"
time="2026-09-26T09:45:05+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.540837282738586&lng=126.9366856544014\": request timeout"
time="2026-09-26T09:45:05+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.540704342904114&lng=127.03509428212622\": request timeout"
time="2026-09-26T09:45:07+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.52185333529786&lng=127.02121119526684\": request timeout"
time="2026-09-26T09:45:08+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.505273725051&lng=126.95505368208728\": request timeout"
time="2026-09-26T09:45:10+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.62859730553709&lng=126.9606521990368\": request timeout"
time="2026-09-26T09:45:11+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.557304321415266&lng=127.05837805892742\": request timeout"
time="2026-09-26T09:45:12+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.62837732992248&lng=126.98676168139828\": request timeout"
time="2026-09-26T09:45:12+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57076776777108&lng=126.984746843118\": request timeout"
time="2026-09-26T09:45:13+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.48439905043182&lng=126.92729794771948\": request timeout"
time="2026-09-26T09:45:16+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.50360828078428&lng=126.99484399195393\": request timeout"
time="2026-09-26T09:45:16+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57550926490812&lng=127.07619747960699\": request timeout"
time="2026-09-26T09:45:17+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.58679267409113&lng=127.05974763220101\": request timeout"
time="2026-09-26T09:45:17+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.570015750358984&lng=127.04970709353096\": request timeout"
time="2026-09-26T09:45:18+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.564259168479595&lng=126.97046196302554\": request timeout"
time="2026-09-26T09:45:20+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57684789829878&lng=127.04910155189783\": request timeout"
time="2026-09-26T09:45:21+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57698057467404&lng=126.99434742935081\": request timeout"
time="2026-09-26T09:45:21+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.560446757597305&lng=126.98158996698443\": request timeout"
time="2026-09-26T09:45:22+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.57725667132414&lng=127.00463315446329\": request timeout"
time="2026-09-26T09:45:23+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.52857686222944&lng=126.94987532355391\": request timeout"
time="2026-09-26T09:45:23+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.56636990933937&lng=126.97047364672454\": request timeout"
time="2026-09-26T09:45:23+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.62039627563841&lng=126.99214917885358\": request timeout"
time="2026-09-26T09:45:23+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.47131946264454&lng=127.02635861160591\": request timeout"
time="2026-09-26T09:45:24+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.629150205558105&lng=127.04045901160316\": request timeout"
time="2026-09-26T09:45:24+09:00" level=warning msg="Request Failed" error="Get \"http://localhost:8093/api/candidates?lat=37.619805176746716&lng=126.94754742034593\": request timeout"


  █ TOTAL RESULTS 

    checks_total.......: 3654   94.152547/s
    checks_succeeded...: 98.13% 3586 out of 3654
    checks_failed......: 1.86%  68 out of 3654

    ✗ ok
      ↳  98% — ✓ 1793 / ✗ 34
    ✗ found
      ↳  98% — ✓ 1793 / ✗ 34

    HTTP
    http_req_duration..............: avg=7.4s  p(50)=8.29s p(95)=9.52s p(99)=10s   max=10.02s
      { expected_response:true }...: avg=7.35s p(50)=8.27s p(95)=9.42s p(99)=9.81s max=9.98s 
    http_req_failed................: 1.86%  34 out of 1827
    http_reqs......................: 1827   47.076274/s

    EXECUTION
    dropped_iterations.............: 13174  339.454202/s
    iteration_duration.............: avg=7.4s  p(50)=8.29s p(95)=9.52s p(99)=10s   max=10.03s
    iterations.....................: 1827   47.076274/s
    vus............................: 36     min=36         max=400
    vus_max........................: 400    min=400        max=400

    NETWORK
    data_received..................: 2.2 MB 58 kB/s
    data_sent......................: 236 kB 6.1 kB/s