experiments/geo-mysql/results/redis-nowrites-pool-500-k6.txt
time="2026-09-26T09:52:42+09:00" level=warning msg="The test has generated metrics with 100016 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester


  █ TOTAL RESULTS 

    checks_total.......: 30002   999.982735/s
    checks_succeeded...: 100.00% 30002 out of 30002
    checks_failed......: 0.00%   0 out of 30002

    ✓ ok
    ✓ found

    HTTP
    http_req_duration..............: avg=34.73ms p(50)=1.86ms p(95)=105.3ms  p(99)=886.17ms max=2.26s
      { expected_response:true }...: avg=34.73ms p(50)=1.86ms p(95)=105.3ms  p(99)=886.17ms max=2.26s
    http_req_failed................: 0.00%  0 out of 15001
    http_reqs......................: 15001  499.991367/s

    EXECUTION
    iteration_duration.............: avg=34.91ms p(50)=1.97ms p(95)=106.31ms p(99)=886.98ms max=2.26s
    iterations.....................: 15001  499.991367/s
    vus............................: 2      min=0          max=245
    vus_max........................: 400    min=400        max=400

    NETWORK
    data_received..................: 17 MB  551 kB/s
    data_sent......................: 1.9 MB 65 kB/s